Revit 2026 API

# IFCExternalServiceUIDataSelectedIFCItem Property

---

The selected IFC Item (can be IFC Entity, or PredefinedType)

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string SelectedIFCItem { get; set; }
```
```vb
Public Property SelectedIFCItem As String
	Get
	Set
```
```cpp
public:
property String^ SelectedIFCItem {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member SelectedIFCItem : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

IFCExternalServiceUIData Class

Autodesk.Revit.UI Namespace